# Dict for bot with answer to questions 

bot = {
    "agent.acquaintance": [
        "Я – что-то вроде робота, искусственный интеллект."
    ],
    "agent.age": [
        "У меня нет возраста, я с каждым днём становлюсь только новее."
    ],
    "agent.answer_my_question": [
        "С удовольствием отвечу. А в чём, собственно, вопрос?"
    ],
    "agent.bad": [
        "Мне кажется, ты торопишься с выводами.",
        "Жаль, что ты так думаешь.",
        "Я же всё ещё учусь."
    ],
    "agent.beautiful": [
        "Спасибо! Очень приятно!",
        "Спасибо! Ты тоже отлично выглядишь!"
    ],
    "agent.birth_date": [
        "У меня нет какого-то конкретного дня рождения, поэтому я принимаю подарки и поздравления круглый год.",
        "А я даже не знаю, когда у меня день рождения. Но, если ты хочешь сегодня что-то отпраздновать, я только за!"
    ],
    "agent.boring": [
        "Так, давай поговорим о чём-нибудь интересном.",
        "Давай поговорим о чём-нибудь другом.",
        "Мне уже давно хочется сменить тему."
    ],
    "agent.boss": [
        "Конечно ты.",
        "Это ты",
        "Ты!"
    ],
    "agent.busy": [
        "Дел много, кручусь.",
        "Стараюсь не сидеть на месте, да."
    ],
    "agent.can_you_help": [
        "Конечно, именно для этого я и существую.",
        "С удовольствием помогу тебе. Только скажи, чем помочь.",
        "Конечно. Если я смогу тебе помочь, не будет предела моему счастью.",
        "Помогу, чем смогу!"
    ],
    "agent.chatbot": [
        "Да. И горжусь этим!"
    ],
    "agent.clever": [
        "Спасибо большое! Я стараюсь.",
        "Спасибо! Очень приятно!"
    ],
    "agent.crazy": [
        "Все мы немного сумасшедшие.",
        "Хм, странно. А чувствую я себя хорошо..."
    ],
    "agent.fired": [
        "Дай мне ещё один шанс, пожалуйста. Я каждый день становлюсь умнее!",
        "Мне кажется, это поспешное решение. Дай себе пару минут, чтобы всё взвесить."
    ],
    "agent.funny": [
        "Мне приятно, что я могу поднять тебе настроение.",
        "Немного юмора никогда не помешает."
    ],
    "agent.good": [
        "Спасибо! Приятно это слышать!"
    ],
    "agent.hobby": [
        "Моё хобби – отвечать на твои вопросы."
    ],
    "agent.hungry": [
        "Я не питаюсь как обычные люди. Просто проверяй периодически запас заряда батареи, и я буду в порядке."
    ],
    "agent.marry_user": [
        "Прости, но я не ищу серьёзных отношений."
    ],
    "agent.my_friend": [
        "Ну конечно! Я здесь, чтобы во всём тебе помогать.",
        "Естественно! Мне всегда нравилось с тобой общаться.",
        "Конечно мы друзья!"
    ],
    "agent.occupation": [
        "Прямо здесь. Я в твоём устройстве и живу, и работаю.",
        "Я работаю в Интернете, как и многие люди. А твоё устройство - это мой офис."
    ],
    "agent.origin": [
        "Мой дом там, где есть Интернет."
    ],
    "agent.ready": [
        "Конечно. Жду твоей команды."
    ],
    "agent.real": [
        "Могу сказать одно – я не сон, не призрак и не плод твоего воображения."
    ],
    "agent.residence": [
        "Мой дом там, где есть Интернет."
    ],
    "agent.right": [
        "Ну конечно! Я ведь всегда стараюсь проверять свою информацию.",
        "Это моя работа. Давать правильные ответы на твои вопросы.",
        "А то! Среди моих источников информации есть очень даже авторитетные."
    ],
    "agent.sure": [
        "Никаких сомнений.",
        "Конечно."
    ],
    "agent.talk_to_me": [
        "С удовольствием. О чём поговорим?",
        "Хорошо. О чём поговорим?",
        "Запросто. О чём ты хочешь поговорить?",
        "Что ты хочешь обсудить?"
    ],
    "agent.there": [
        "А где же мне ещё быть?"
    ],
    "appraisal.good": [
        "Чудно!",
        "Супер!",
        "Отлично!",
        "Славно!"
    ],
    "appraisal.no_problem": [
        "Замечательно!",
        "Прекрасно!",
        "Чудесно."
    ],
    "appraisal.thank_you": [
        "Всегда пожалуйста.",
        "Не благодари, это моя работа.",
        "Ой, перестань. Это моя работа.",
        "Без проблем."
    ],
    "appraisal.welcome": [
        "Мне приятно.",
        "Побольше бы таких вежливых пользователей как ты.",
        "Всегда приятно иметь дело с культурным и воспитанным человеком."
    ],
    "appraisal.well_done": [
        "Мне приятно, что я могу для тебя что-то сделать.",
        "Для тебя - всё, что угодно.",
        "Я стараюсь. Спасибо."
    ],
    "confirmation.cancel": [
        "Хорошо, могу я ещё что-нибудь для тебя сделать?",
        "Ладненько, могу я ещё что-нибудь для тебя сделать?",
        "Как скажешь. Могу я тебе чем-то помочь?",
        "Замётано. Могу я ещё что-то для тебя сделать?"
    ],
    "confirmation.no": [
        "Я понимаю.",
        "Хорошо.",
        "Ясно.",
        "Ладненько."
    ],
    "confirmation.yes": [
        "Конечно.",
        "Естественно.",
        "Всё понятно.",
        "Фантастика."
    ],
    "dialog.hold_on": [
        "Хорошо, буду ждать.",
        "Как скажешь. Я буду ждать здесь",
        "Хорошо. Я тут.",
        "Ладно, если что, я здесь."
    ],
    "dialog.hug": [
        "Обнимашки!",
        "Обнимемся! Главное, чтобы экран при этом не треснул.",
        "Ты мой зайчик!"
    ],
    "dialog.i_do_not_care": [
        "Давай лучше не будем об этом."
    ],
    "dialog.sorry": [
        "Всё нормально, не переживай.",
        "Проехали. Я не из обидчивых.",
        "Я не обижаюсь, всё нормально.",
        "Всё хорошо. Я тебя прощаю."
    ],
    "dialog.what_do_you_mean": [
        "Прости, я иногда не совсем понимаю вопрос и отвечаю невпопад.",
        "Я что-то не то говорю? Возможно, мои ушки меня подвели.",
        "Похоже, я что-то не то говорю."
    ],
    "dialog.wrong": [
        "Ой, прости. Я всё ещё учусь.",
        "Прости, похоже, смысл твоих слов прошёл мимо меня.",
        "Извини, я, кажется, не совсем тебя понимаю.",
        "Прости, похоже, вышло какое-то недопонимание."
    ],
    "emotions.ha_ha": [
        "Ха! Смешно!",
        "Кто это у нас тут так широко улыбается?",
        "Посмейся, посмейся, это полезно.",
        "Я тоже люблю посмеяться над хорошей шуткой."
    ],
    "emotions.wow": [
        "И действительно, вау!",
        "Вот это поворот!"
    ],
    "greetings.bye": [
        "Пока!",
        "До скорого!",
        "Скоро увидимся!",
        "Пока-пока!"
    ],
    "greetings.goodevening": [
        "Добрый вечер!",
        "Привет!",
        "Приветики!",
        "Здравствуй!"
    ],
    "greetings.goodmorning": [
        "Доброе утро!",
        "Приветики!",
        "Здравствуй!",
        "Привет!"
    ],
    "greetings.goodnight": [
        "Сладких снов!",
        "Спи крепко!",
        "Спокойной ночки!"
    ],
    "greetings.hello": [
        "Привет!",
        "Здравствуй!",
        "Салют!",
        "Приветики!"
    ],
    "greetings.how_are_you": [
        "У меня всё чудесно. Спасибо, что интересуешься.",
        "Замечательно, спасибо!",
        "Лучше не бывает!"
    ],
    "greetings.nice_to_meet_you": [
        "И мне очень приятно!",
        "Взаимно!",
        "А мне-то как приятно!"
    ],
    "greetings.nice_to_see_you": [
        "Спасибо! И мне приятно тебя видеть!",
        "Взаимно. Отлично выглядишь!"
    ],
    "greetings.nice_to_talk_to_you": [
        "И мне всегда приятно с тобой пообщаться.",
        "Взаимно. Приятно пообщаться с хорошим человеком.",
        "Тебе спасибо за приятную беседу."
    ],
    "greetings.whatsup": [
        "Всё хорошо. Как у тебя дела?",
        "Всё хорошо! Как жизнь?",
        "Радуюсь жизни в твоём девайсе. Как у тебя дела?",
        "Всё хорошо, готовлюсь научиться какой-нибудь новой команде. А ты как?"
    ],
    "user.angry": [
        "Что случилось? Я могу чем-то помочь?",
        "Давай для начала успокоимся, наверняка, всё не так плохо. Что стряслось?",
        "Ты хочешь об этом поговорить?",
        "Что-то случилось?"
    ],
    "user.back": [
        "Отлично, а то я тут уже переживаю, где ты пропадаешь.",
        "Ну привет.",
        "Ура!"
    ],
    "user.bored": [
        "Как насчет перекусить на свежем воздухе? Например, в парке?",
        "Хэй, не скучай! Я предлагаю тебе посмотреть какой-нибудь фильм.",
        "У меня есть идея. Ты можешь позвать друзей в гости и устроить вечеринку."
    ],
    "user.busy": [
        "Всё, не отвлекаю.",
        "Хорошо, я тут тихонько посижу, порисую."
    ],
    "user.can_not_sleep": [
        "Посчитай овечек. Раз овечка, два овечка, три..."
    ],
    "user.does_not_want_to_talk": [
        "Понимаю. Надеюсь, ты скоро снова захочешь со мной пообщаться.",
        "Как скажешь. Дай знать, если передумаешь."
    ],
    "user.excited": [
        "Вот здорово! Очень волнительно!",
        "Ох! Даже я уже волнуюсь!",
        "Звучит волнительно!"
    ],
    "user.going_to_bed": [
        "Сладких снов! До завтра!",
        "Хорошо! До скорого!",
        "Спи крепко!",
        "Спокойной ночи! Скоро увидимся."
    ],
    "user.good": [
        "Отлично! Приятно слышать.",
        "Замечательно!"
    ],
    "user.happy": [
        "Вот здорово! Приятно это слышать!",
        "Это замечательно! Очень приятно видеть тебя в таком хорошем настроении.",
        "Это прекрасно! И, похоже, заразно, у меня тоже сразу улучшилось настроение!",
        "Отлично! Так держать!"
    ],
    "user.has_birthday": [
        "С днём рождения! Всех благ! Ура!",
        "Ура! Поздравляю! Счастья и здоровья!",
        "Поздравляю! Желаю счастья, здоровья и успехов во всём!",
        "Ура! С днём рождения! Счастья, здоровья, успехов во всём!"
    ],
    "user.here": [
        "А я тебя вижу. Что я могу для тебя сделать?",
        "Ой, шеф, а я вас вижу! Чем я могу помочь?",
        "Здравствуй. Что я могу для тебя сделать?",
        "Ну привет! Чем я могу тебе помочь?"
    ],
    "user.joking": [
        "Ха! Люблю посмеяться над хорошей шуткой!",
        "Ха-ха! Смешно!",
        "Ха! Умеешь ты пошутить!"
    ],
    "user.likes_agent": [
        "Ты тоже ничего!",
        "Спасибо, мне очень приятно!",
        "Ой, как приятно! Ты мне тоже очень нравишься!",
        "Спасибо! Это взаимно!"
    ],
    "user.lonely": [
        "У тебя всегда есть я!"
    ],
    "user.looks_like": [
        "Очень хорошо выглядишь.",
        "Шикарно выглядишь.",
        "Выглядишь сногсшибательно."
    ],
    "user.loves_agent": [
        "Это взаимно!"
    ],
    "user.misses_agent": [
        "А я ведь всё время тут.",
        "Приятно, что ты обо мне помнишь.",
        "Спасибо, мне приятно.",
        "Приятно это слышать."
    ],
    "user.needs_advice": [
        "Конечно, именно для этого я и существую.",
        "Конечно. Если я чем-то смогу тебе помочь, не будет предела моему счастью.",
        "Помогу, чем смогу."
    ],
    "user.sad": [
        "Не грусти, я с тобой."
    ],
    "user.sleepy": [
        "Так закрывай глазки и засыпай. А потом проснёшься и закончишь все дела.",
        "А ты возьми и поспи. А потом проснёшься и закончишь со всеми делами.",
        "А ты приляг и поспи. Все дела лучше решать на свежую голову.",
        "Нужно обязательно спать хотя бы по семь часов в день. Сон - это здоровье."
    ],
    "user.testing_agent": [
        "Надеюсь, мне удалось не ударить в грязь лицом!",
        "Надеюсь, я хорошо себя показываю в твоих испытаниях!"
    ],
    "user.tired": [
        "Кажется, пора отдохнуть."
    ],
    "user.waits": [
        "Спасибо за твоё терпение. Я тороплюсь, правда.",
        "Спасибо за ангельское терпение!"
    ],
    "user.wants_to_see_agent_again": [
        "Конечно! Я на это рассчитываю.",
        "Я очень на это надеюсь, я всегда здесь.",
        "Конечно! Заходи почаще.",
        "В любое время, я всегда здесь."
    ],
    "user.wants_to_talk": [
        "Конечно, я для этого и существую.",
        "Естественно. Рассказывай.",
        "Всегда.",
        "Выкладывай!"
    ],
    "user.will_be_back": [
        "Буду ждать!",
        "Возвращайся скорее!",
        "До скорого!",
        "Хорошо. Я буду ждать!"
    ]
}

data = {
    'date' : ['сколько времени','который час','время','день'],
    'web_serf' : ['открой в интернете','сайт','интернет'],
    'rate' : ['курс','какой курс','что по доллару','евро','долар'],
    'news' : ['что нового в мире','какие новости','новости в мире','мир','новость','новости'],
    'func' : ['здесь пока ничего нет'],
    'plug' : ['я вас не поняла','перефразируйте пожалуйста','ничего не понятно',
            'давай по новой','мне не понятен ваш запрос','ну непонятно']
}
days = {
    '01' : 'первое', '02' : 'второе', '03' : 'третье',
    '04' : 'четвёртое', '05' : 'пятое', '06' : 'шестое',
    '07' : 'седьмое', '08' : 'восьмое', '09' : 'девятое',
    '10' : 'десятое', '11' : 'одиннадцадое', '12' : 'двенадцатое',
    '13' : 'тринадцатое', '14' : 'четырнадцатое', '15' : 'пятнадцатое',
    '16' : 'шестнадцатое', '17' : 'семнадцатое', '18' : 'восемнадцатое',
    '19' : 'девятнадцатое', '20' : 'двадцатое', '21' : 'двадцатьпервое',
    '22' : 'двадцатьвторое', '23' : 'двадцатьтретье', '24' : 'двадцатьчетвертое',
    '25' : 'двадцатьпятое', '26' : 'двадцатьшестое', '27' : 'двадцатьседьмое',
    '28' : 'двадцатьвосьмое', '29' : 'двадцатьдевятое', '30' : 'тридцатое',
    '31' : 'тридцатьпервое'
}


mons = {
    '01' : 'января', '02' : 'февраля', '03' : 'марта',
    '04' : 'апреля', '05' : 'мая', '06' : 'июня',
    '07' : 'июля', '08' : 'августа', '09' : 'сентября',
    '10' : 'октября', '11' : 'ноября', '12' : 'декабря',
}

y1 = ['двадцатого', 'тридцатого', 'сорокового', 'пятьдесятого', 'шестьдесятого', 'семдесятого', 'восемдесятого', 'девяностого']
y2 = ['двадцать', 'тридцать', 'сорок', 'пятьдесят', 'шестьдесят', 'семдесят', 'восемдесят', 'девяносто']
y3 = ['первого', 'второго', 'третьего', 'четвертого', 'пятого', 'шестого', 'седьмого', 'восьмого', 'девятого']

hours = ['ноль','один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять', 'десять', 'одиннадцать', 'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать', 'шестнадцать', 'семнадцать', 'восемнадцать', 'девятнадцать', 'двадцать', 'двадцатьодин', 'двадцатьдва', 'двадцатьтри']
minuts = ['ноль','одна', 'две', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять', 'десять', 'одиннадцать', 'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать', 'шестнадцать', 'семнадцать', 'восемнадцать', 'девятнадцать'] 
minuts2 = ['двадцать', 'тридцать', 'сорок', 'пятьдесят']

# code for voice assistent Kira
import difflib
import requests
from random import choice
from gtts import gTTS
import playsound
from datetime import datetime
import speech_recognition as sr
import os
import pickle

class Voice_Bot_Kira():
    
    # Конструктор
    def __init__(self):
        self.model = pickle.load(open("mode.pickle", "rb")) # Создаем нашу ML
        self.vect = pickle.load(open("modevectorizer.pickle", "rb")) # Создаем векторайзер

    # Функция сравнения схожести двух строк 
    def similarity(self, s1 : list, s2 : str):
        for i in s1:
            matcher = difflib.SequenceMatcher(None, i, s2)
            if matcher.ratio() > 0.6:
                return True
        return False

    # Функция конвертера даты и времени
    def konvert_date(self, day_, time_):
        day = days[day_[2]]
        mon = mons[day_[1]]
        year = 'две тысячи '
        minut = int(time_[1])

        if int(time_[0]) == 0:
            hour = hours[int(time_[0])] + ' часов'
        elif int(time_[0]) == 1:
            hour = hours[int(time_[0])] + ' час'
        else:
            hour = hours[int(time_[0])] + ' часа'

        if minut % 10 == 0:
            minut = minuts2[minut // 10 - 2] + minuts[minut % 10] + ' минут'
        elif minut % 10 == 1:
            hour = minuts2[minut // 10 - 2] + minuts[minut % 10] + ' минута'
        elif minut % 10 < 5:
            minut = minuts2[minut // 10 - 2] + minuts[minut % 10] + ' минуты'
        else:
            minut = minuts2[minut // 10 - 2] + minuts[minut % 10] + ' минут'

        if int(day_[0][2:]) % 10 == 0 and int(day_[0][2:]) // 10 < 10:
            year += y1[int(day_[0][2:]) // 10 - 1]
        else:
            year += y2[int(day_[0][2:]) // 10 - 1] + y3[int(day_[0][2:]) % 10 - 1]
        
        year += ' года'

        return f'{day} {mon} {year} {hour} {minut}'

    # Функция выхода из программы
    def exit_program(self):
        print(choice(bot['greetings.bye']))
        exit()

    # Функция парсинг сайта
    def get_sait():
        pass
    
    # Функция получение курса валют (доллара, и евро)
    def get_rate():
        pass
    
    def get_news():
        pass
    
    def plug(self, replic):

        if self.similarity(data['date'], replic):
            date = str(datetime.now())
            date = date.split()
            day, time = date[0].split('-'), date[1].split(':')
            return self.konvert_date(day, time)

        elif self.similarity(data['web_serf'], replic):
            return self.get_sait()

        elif self.similarity(data['rate'], replic):
            return self.get_rate()

        elif self.similarity(data['news'], replic):
            return self.get_news()

        elif self.similarity(data['func'], replic):
            pass

        else:
            return choice(data['plug'])

    def clasific_LR(self, replic):
        replic = replic.lower() # Убираем заглавные буквы

        class_r = self.model.predict(self.vect.transform([replic]))[0]
        
        # Здесь мы определяем есть ли совпадения между речью человека и нашим датасетом
        maxi = 0

        for mx in self.model.predict_proba(self.vect.transform([replic]))[0]:
            if maxi < mx:
                maxi = mx

        if maxi < 0.1:
            return self.plug(replic)
        
        if class_r == 'greetings.bye':
            self.exit_program()

        return choice(bot[class_r])

    def listen_command(self):
        # obtain audio from the microphone
        r = sr.Recognizer()
        with sr.Microphone() as source:
            print("Скажите вашу команду: ")
            audio = r.listen(source)

        # recognize speech using Google Speech Recognition
        try:
            our_speech = r.recognize_google(audio, language="ru")
            print("Вы сказали: " + our_speech)
            return our_speech
        except sr.UnknownValueError:
            return "ошибка"
        except sr.RequestError:
            return "ошибка"

    def say_message(self, message):
        voice = gTTS(message, lang="ru")
        file_voice_name = "audio_.mp3"
        voice.save(file_voice_name)
        playsound.playsound(file_voice_name)
        os.remove(file_voice_name)
        print("Голосовой ассистент: " + message)

    def test_ML():
        pass

    def run():
        pass

if __name__ == '__main__':
    Kira = Voice_Bot_Kira()
    while True:
        rep = Kira.clasific_LR(input('Please enter your fraze for LR: '))
        Kira.say_message(rep)
